// Задача 27 Напишите программу, которая принимает на вход число и выдает сумму цифр в числе

 void Zadacha27()
 {
     Console.Write("Введите число: ");
     int num = Convert.ToInt32(Console.ReadLine());
     int sum = 0;
     while ( num > 0)
     {
         int digit = num % 10;
         sum = sum + digit;
         num = num /= 10;
         
     }
     Console.WriteLine(sum);

 }
 Zadacha27();